app/views/listings/_listing.html.erb

SELECT "listings".* FROM "listings"
---
            <div>
                <% if user_signed_in? && current_user.listings.include?(listing) %>