app/controllers/listings_controller.rb

  def create
    marketplace = Balanced::Marketplace.mine
    owner_customer = current_user.balanced_customer
    bank_account_href = params[:bank_account_href]

    # add bank account href passed back from balanced.js
    bank_account = Balanced::BankAccount.fetch(bank_account_href)
    bank_account.associate_to_customer(owner_customer)
    current_user.bank_account_href = bank_account.href
    current_user.save

    @listing = current_user.listings.new(
      title: params[:listing_title],
      location: params[:listing_location],
      bicycle_type: params[:listing_bike_type],
      price: params[:listing_rent_price].to_i * 100
    )

    if @listing.save!
---
INSERT INTO "listings" ("created_at", "owner_uri", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 22 May 2013 18:58:15 UTC +00:00], ["owner_uri", "/v1/customers/CU4pGfrAaRDwjFAbjXPAeKfu"], ["title", "new listing!"], ["updated_at", Wed, 22 May 2013 18:58:15 UTC +00:00]]

  def new
    @random_listing = Listing.find(rand(Listing.all.length)+1)
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT 1  [["id", 3]]